import img1 from "../../../../Assets/images/Service/1.png";
import enroll from "../../../../Assets/images/Service/4.png";
import classchild from "../../../../Assets/images/Service/3.png";
import support from "../../../../Assets/images/Service/5.png";

export const Data = [
  {
    id: 1,
    img: img1,
    dec: "  می توانید با بهره مندی از تجارب مشاوران و مدرسان حرفه ای،دوره مناسب آموزش برنامه نویسی را انتخاب نمایید.",
    text: "مشاوره",
  },
  {
    id: 2,
    img: enroll,
    dec: "  آموزشگاه برنامه نویسی تحلیل داده محیط عملی را با برترین اساتید برنامه نویسی و دیتابیس در ایران،همراه با لابراتوار مجهز در اختیار شما قرار می دهد.",

    text: "یادگیری انعطاف پذیر",
  },
  {
    id: 3,
    img: classchild,
    dec: " با شرکت در کلاسهای آموزش برنامه نویسی، به تجربه ای عملی در محیطی علمی دست خواهید یافت و از برنامه ای بی نظیر بهره مند خواهید شد. ",
    text: " شرکت در کلاس ",
  },
  {
    id: 4,
    img: support,
    dec: " پشتیبانی علمی و عملی از دانشجویان پس از پایان دوره از تعهدات ماست. تا زمان احساس موفقیتتان در کنار شما خواهیم بود.  ",
    text: "پشتیبانی رایگان",
  },
];
