import { createContext, useState } from "react";

export const themeContext = createContext();

const ThemeState = ({ children }) => {
  const getTheme = localStorage.getItem("theme")
  // console.log("getTheme",getTheme)
  const [theme, setTheme] = useState(getTheme||"light");

  return (
    <themeContext.Provider value={{ theme, setTheme }}>
      {children}
    </themeContext.Provider>
  );
};

export default ThemeState;






// ******************
// ******************
// ******************
// ******************
// useEffect(() => {
//   localStorage.setItem("theme", theme);

// });
// یوزافکت اگر ارگیومنت دومش روما چیزی نزاشتیم هرزمان که استیت ما تعییر کنه
// این یوزافکت هم اجرا میشه
// هر وقت مقدار تم تعییر کرد این یوزافکت هم اجرا شود

// ارایه خالی
// [] 
//  که میزاریم یعنی یوزافکت فقط زمانی اجرا بشه که
// این کانتکس برای بار اول لود میشه ولی ما اینو نمخوایم
// یعنی هر وقت که این دارک شد یا لایت شد دیگه این یوزافکت اجرا نمیشه فقط
// برای بار اول اجرا میشه
// الان که مقدار خالی بزاریم هر دفعه که مقدار استیت تعییر کنه
// این یوزافکت هم اجرا میشه

// ******************
// ******************
// ******************
// ******************
// اون طرف یعنی داخل هوک ها
// useDarkMode
// ما یوزافکت رواونجا گزاشتیم و بهش وابستگی
// دادیم
// اینجا باید بهش بگیم که
// هر بار که تم تعییر میکنه بیا اجرا شو
// البته الان ما 

// useEffect(() => {
  // localStorage.setItem("theme" ,theme)
// })

// چون ما استیت داخل هوک نداریم  
//  جایی که ما استیت رو داریم
// داخل کانتکس هست 
// در کنار یوزافکت اون جا میتونستیم این کار که وابستگی رونزاریم
// و فقط مثل توضحیات بالا که دلیلشو نوشتم اونجا به کار ببریم

// البته یه نکته که هست الان =>
// من وابستگی روگرفتم  داره جواب مبده

// ******************
// ******************
// این که چه زمانی تابع ما بیاد اجرا بشه دارک بشه یا لایت بشه دست خودمون هست
// با استفاده از همون
// value

// ******************
// ******************

// ِیوزکانتکس این طوری کار میکنه که هر جا بهش اون کانتکس ساخته شده رو بدیم
// اون ولیو که همون 
// theme settheme 
// بهمون میده

// ******************
// ******************

// const [theme, setTheme] = useState("");
// مقدار اولیه استیت تم باید از لوکال استورچ گرفته بشه