export const DataUser = [
    {
      id: 1,
      name: "mozhgan",
      data: "1401.2.5",
      text: "      سلام و درود. واقعا یه خسته نباشید و یه تشکر به استاد بدهکاریم برای تولید همچین دوره باکیفیتی .همچنین امیدوارم استاد از ادامه راه خسته نشه و همینطور با قدرت ادامه بده.",
    },
    {
      id: 2,
      name: "zahra",
      data: "1401.2.6",
      text: "      سلام و درود. واقعا یه خسته نباشید و یه تشکر به استاد بدهکاریم برای تولید همچین دوره باکیفیتی .همچنین امیدوارم استاد از ادامه راه خسته نشه و همینطور با قدرت ادامه بده.",
    },
    {
      id: 3,
      name: "ali",
      data: "1401.4.7",
      text: "      سلام و درود. واقعا یه خسته نباشید و یه تشکر به استاد بدهکاریم برای تولید همچین دوره باکیفیتی .همچنین امیدوارم استاد از ادامه راه خسته نشه و همینطور با قدرت ادامه بده.",
    },
    {
      id: 4,
      name: "ali",
      data: "1401.4.7",
      text: "      سلام و درود. واقعا یه خسته نباشید و یه تشکر به استاد بدهکاریم برای تولید همچین دوره باکیفیتی .همچنین امیدوارم استاد از ادامه راه خسته نشه و همینطور با قدرت ادامه بده.",
    },
  ];
  